import pandas as pd
# pip install pandas

# Завантажуємо датафрейм
df = pd.read_csv('GoogleApps.csv')


# ПЕРШИЙ ТЕСТ

# Перша програма в наборі даних
print(df.head())  # Photo Editor & Candy Camera & Grid & ScrapBook

# До якої категорії відноситься додаток, розташований останнім у наборі даних?
print(df["Category"].tail())  # LIFESTYLE

# Скільки стовпців міститься у наборі даних?
df.info()  # 12

# ===========================================

# ДРУГИЙ ТЕСТ

df.info()

# Rating - float64 (дробові числа)
# Reviews - int64 (числа)
# Content Rating - object (текст)


# ===========================================

# ТРЕТІЙ ТЕСТ

df.info()

# Вкажіть середнє арифметичне (округліть результат до сотих)
# та медіану (ціле число) розміру додатків (size).

# Середнє арифметичне:
print(df["Size"].mean())  # 22.77

# Медіана:
print(df["Size"].median())  # 14

# Скільки коштує найдорожчий додаток? Введи відповідь у вигляді цілого числа.
print(df[df["Type"] == "Paid"]["Price"].max())  # 400

# ===========================================

# БОНУСНЕ

print(df["Installs"].describe())
# Середнє 8.662313e+06
# Медіана 1.000000e+05

# ===========================================

df.info()

# Скільки коштує найдешевший платний додаток?
print(df[df["Type"] == "Paid"]["Price"].min())  # 0.99

# Чому дорівнює медіана кількості установок додатків із категорії ART_AND_DESIGN?
print(df[df["Category"] == "ART_AND_DESIGN"]["Installs"].median())  # 100000.0
